{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "activation": "relu",
            "input_shape": [224, 224, 3],
            "name": "conv2d_1",
            "trainable": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "name": "max_pooling2d_1",
            "trainable": true
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_size": [3, 3],
            "activation": "relu",
            "name": "conv2d_2",
            "trainable": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "name": "max_pooling2d_2",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "softmax",
            "name": "dense_2",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"},
        {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [12544, 128], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [128, 4], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}
      ]
    }
  ]
} 